Catalogs/МедицинскиеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МедицинскиеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаполняемыеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыМедицинскойКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПараметрыМедицинскойКарты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяВручнуюЗаполненногоПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/омг_АктуальностьМедицинскихКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_АктуальностьМедицинскихКарт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МедицискаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сертификаты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.КартыСкидок</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрохождениеМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭлектронныеПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЭлектронныеПодписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия набора ключевых реквизитов для подписания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомуВыданСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписьВерна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиПодписи</Name>
					<Comment>Заполнено только в том случае, если подпись неверна</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиСертификата</Name>
					<Comment>Заполнено только в том случае, если сертификат недействителен</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстановившийПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанФайлЭМД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Подписанный объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодписанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РолиИПодписиЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РолиИПодписиЭМД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УИД_ЭЦП</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольПодписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПриПодписиМедДокументов</v8:Type>
						<v8:Type>cfg:EnumRef.РолиПодписей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД_ЭМД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРоли</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыМедицинскихКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыМедицинскихКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Суффикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Макет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВнешняяПФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксФилиалаДоПрефиксаВида</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМедицинскихКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвусторонняяПечать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаполняемыеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыМедицинскойКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПараметрыМедицинскойКарты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МедицинскиеКарты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область РазделОписанияПеременных

&НаКлиенте
Перем ТекстЯчейкиПередНепосредственнымРедактированием;

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	
	// Чтение штрихкода карты
	Если Не ЭтоНовый Тогда
		Если ПрочитатьШтрихкодМедкарты() Тогда
			Элементы.ПрисвоитьШтрихкод.Доступность = Ложь;
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(Объект.ВидКарты) Тогда
			Объект.ВидКарты = мУчетнаяПолитика.ОсновнойВидМедКарт;
		КонецЕсли;
		
		Объект.ДатаРегистрации = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЭтоНовый Тогда
		Если ЗначениеЗаполнено(Параметры.Основание)	Тогда
			Если ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.Заявка") Тогда
				Объект.Клиент = Параметры.Основание.Клиент;
			ИначеЕсли ТипЗнч(Параметры.Основание) = Тип("СправочникСсылка.Клиенты") Тогда
				Объект.Клиент = Параметры.Основание;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
			Объект.Наименование = "№";
		КонецЕсли;
	КонецЕсли;	
	
	#Область ЭлектронныеПодписи
	ИспользуютсяЭП = ЭЦП_УМЦ_Сервер.ИспользоватьЭлектронныеПодписиЭМК();
	
	Если ИспользуютсяЭП И Не Объект.Ссылка.Пустая() Тогда
		Если Объект.ПодписанЭП Тогда
			ОбновитьСписокПодписей();
		Иначе
			доп_СертификатыЭЦП.ЗаполнитьСводкуПодписей(Объект.Ссылка, СводкаHTML, ЭлектронныеПодписи);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступностьВидимостьПоЭП();
	#КонецОбласти
	
	НастроитьПоВидуМедкарты();
	Если ЗначениеЗаполнено(Объект.ВидКарты) Тогда
		ОбновитьПредпросмотрНаСервере();
	КонецЕсли;
	
	// Добавлено Макеев (
	Если Не Параметры.Ключ.Пустая() Тогда
		омг_АктивнаяКарта = омг_ЭтоАктуальнаяКарта(Объект.Клиент, Объект.Ссылка);
	КонецЕсли;
	// )
КонецПроцедуры

&НаСервереБезКонтекста
Функция омг_ЭтоАктуальнаяКарта(Пациент, МедицинскаяКарта)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пациент", Пациент);
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедицинскаяКарта);
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_АктуальностьМедицинскихКарт.Пациент КАК Пациент,
	               |	омг_АктуальностьМедицинскихКарт.ВидКарты КАК ВидКарты,
	               |	омг_АктуальностьМедицинскихКарт.МедицискаяКарта КАК МедицискаяКарта
	               |ИЗ
	               |	РегистрСведений.омг_АктуальностьМедицинскихКарт КАК омг_АктуальностьМедицинскихКарт
	               |ГДЕ
	               |	омг_АктуальностьМедицинскихКарт.Пациент = &Пациент
	               |	И омг_АктуальностьМедицинскихКарт.МедицискаяКарта = &МедицинскаяКарта";
	
	КартаАктуальная = Не Запрос.Выполнить().Пустой();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КартаАктуальная;
	
КонецФункции

&НаСервереБезКонтекста
Процедура омг_ЗаписатьАктуальностьКарты(Пациент, ВидКарты, МедицинскаяКарта, Актуальность)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.омг_АктуальностьМедицинскихКарт.СоздатьМенеджерЗаписи();
	Запись.Пациент = Пациент;
	Запись.ВидКарты = ВидКарты;
	Если Не Актуальность Тогда
		Запись.Прочитать();
		Если Запись.МедицискаяКарта = МедицинскаяКарта Тогда
			Запись.Удалить();
		КонецЕсли;
	Иначе
		Запись.МедицискаяКарта = МедицинскаяКарта;
		Запись.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДополнительныеСвойства = Новый Структура;
	ЗаполнитьСписокПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДополнительныеСвойства.Вставить("ЗаписьНового", Объект.Ссылка.Пустая());
	
	Если ЗначениеЗаполнено(ШтрихКод)
		И Не ЗначениеЗаполнено(ТипШтрихкода)
	Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,НСтр("ru='Нельзя сохранить штрихкод без указания типа штрихкода!'"), 10);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.НомерКарты) Тогда
		ОтраслевыеДополнения.ФормированиеНомера(ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ШтрихкодИзменен Тогда 
		
		НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Владелец.Установить(ТекущийОбъект.Ссылка);
		
		Если ЗначениеЗаполнено(Штрихкод) И ЗначениеЗаполнено(ТипШтрихкода) Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();             
			НоваяЗапись.Владелец = ТекущийОбъект.Ссылка;
			НоваяЗапись.Штрихкод = ШтрихКод;
			НоваяЗапись.ТипШтрихкода = ТипШтрихкода;
			
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		
	ИначеЕсли ДополнительныеСвойства.ЗаписьНового
			И мУчетнаяПолитика.АвтоматическиШтрихкодироватьМедицинскиеКарты
	Тогда
		
		ПрочитатьШтрихкодМедкарты(ТекущийОбъект.Ссылка);	
		
	КонецЕсли;
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("КлиентИзменен") Тогда
		ДополнительныеСвойства.Вставить("КлиентИзменен", ТекущийОбъект.ДополнительныеСвойства.КлиентИзменен);
	КонецЕсли;
	
	ШтрихкодИзменен = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Автоматическая смена основной карты клиента, если той нет или закрыта, или удалена.
	Если ЗначениеЗаполнено(Объект.Клиент)
		И Не Объект.ПометкаУдаления
		И (Объект.ДатаЗакрытия > ТекущаяДата() Или Не ЗначениеЗаполнено(Объект.ДатаЗакрытия)) // Медкарта не закрыта, не удалена.
	Тогда
		ТекущаяОсновнаяКарта = Объект.Клиент.ОсновнаяМедицинскаяКарта;
		
		Если Не ЗначениеЗаполнено(ТекущаяОсновнаяКарта)
				Или (ТекущаяОсновнаяКарта <> Объект.Ссылка 
					 И (ТекущаяОсновнаяКарта.ПометкаУдаления 
						Или (ТекущаяОсновнаяКарта.ДатаЗакрытия < ТекущаяДата() И ЗначениеЗаполнено(ТекущаяОсновнаяКарта.ДатаЗакрытия))))
		Тогда
			КлиентОбъект = Объект.Клиент.ПолучитьОбъект();
			КлиентОбъект.ОсновнаяМедицинскаяКарта = Объект.Ссылка;
			КлиентОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьСтандартныеДейтсвияПередЗаписью");
			КлиентОбъект.Записать();
			ДополнительныеСвойства.Вставить("ИзмененаОсновнаяМедКартаКлиента");
		КонецЕсли;
	КонецЕсли;
	
	// Добавлено Макеев (
	омг_ЗаписатьАктуальностьКарты(Объект.Клиент, Объект.ВидКарты, Объект.Ссылка, омг_АктивнаяКарта);
	// )
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Автоматическая смена основной карты клиента, если та закрыта или удалена. Оповещение формы клиента.
	Если ДополнительныеСвойства.Свойство("ИзмененаОсновнаяМедКартаКлиента") Тогда
		Оповестить("КлиентИзменен", Объект.Клиент,Объект.Ссылка);
		
	ИначеЕсли ДополнительныеСвойства.Свойство("КлиентИзменен") Тогда
		Оповестить("КлиентИзменен", Объект.Клиент);
	КонецЕсли;
	
	ЗаполнитьСписокПараметров();
	
	ДополнительныеСвойства.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НовыйШтрихкод(Команда)
	
	Если Не РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма) Тогда
		
		Возврат;
		
	КонецЕсли;

	Структура = Новый Структура("ШтрихКод, ТипШтрихкода, ЕдиницаИзмерения, ХарактеристикаНоменклатуры", "", ТипШтрихкода, ПредопределенноеЗначение("Справочник.ЕдиницыИзмерения.ПустаяСсылка"), ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	
	РаботаСТорговымОборудованиемКлиент.КнопкаНовыйШрихкодНажатие(Структура, Объект.Ссылка);
	
	ПрочитатьШтрихкодМедкарты();
	
	ТипШтрихкода = ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыШтрихкодов.EAN13");
	
	ШтрихкодИзменен = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрЭМК(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Клиент, Медицинскаякарта", Объект.Клиент, Объект.Ссылка);
	ОткрытьФорму("Обработка.ПросмотрМедКарт.Форма.ФормаАмбулаторнаяМК", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредпросмотр(Команда)
	
	Если РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма) Тогда 
		ОбновитьПредпросмотрНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименование(Команда)
	
	ФормированиеНомера(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоВидуМедкарты(Команда)
	
	Если Объект.ЗаполняемыеПараметры.Количество() > 0 И 
		Вопрос(НСтр("ru = 'Табличная часть будет очищена.'") + " " + НСтр("ru = 'Продолжить?'"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет 
	Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокПараметров();

КонецПроцедуры

&НаКлиенте
Процедура УдалитьВручнуюДобавленныйПараметр(Команда)
	
	ТекДанные = Элементы.ЗаполняемыеПараметры.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПараметра = Объект.ЗаполняемыеПараметры.НайтиПоИдентификатору(ТекДанные.ПолучитьИдентификатор());
	Объект.ЗаполняемыеПараметры.Удалить(СтрокаПараметра);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НомерКартыПриИзменении(Элемент)
	
	ФормированиеНомера(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПациентПриИзменении(Элемент)
	
	ФормированиеНомера(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКартыПриИзменении(Элемент)
	
	Объект.НомерКарты = Неопределено;
	ЗаполнитьСписокПараметров();
	НастроитьПоВидуМедкарты();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняемыеПараметрыИмяПараметраПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЗаполняемыеПараметры.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.ИмяПараметра) Тогда 
		
		ТипЗначенияПараметра = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекДанные.ИмяПараметра, "ТипЗначения");
		ТекДанные.Значение = ТипЗначенияПараметра.ПривестиЗначение(Неопределено);
		
		Элементы.ЗаполняемыеПараметрыЗначение.ДоступныеТипы = ТипЗначенияПараметра;	
		Если ТипЗначенияПараметра.Типы().Количество() > 1 Тогда
			Элементы.ЗаполняемыеПараметрыЗначение.ВыбиратьТип = Истина;
		Иначе 
			Элементы.ЗаполняемыеПараметрыЗначение.ВыбиратьТип = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняемыеПараметрыПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ЗаполняемыеПараметры.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.ИмяПараметра) Тогда
		Элементы.ЗаполняемыеПараметрыЗначение.ДоступныеТипы = ТекДанные.ТипЗначения;
		Элементы.ЗаполняемыеПараметрыЗначение.ОграничениеТипа = ТекДанные.ТипЗначения;
		Элементы.ЗаполняемыеПараметрыЗначение.КнопкаВыбора = ?(ТекДанные.ТипЗначения.СодержитТип(Тип("Строка")), Истина, Неопределено);
	КонецЕсли;
	
	Элементы.УдалитьВручнуюДобавленныйПараметр.Доступность = Не ИзмененияЗапрещены И ЗначениеЗаполнено(ТекДанные.ИмяВручнуюЗаполненногоПараметра);
	
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	
	ФормированиеНомера(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)
	ШтрихкодИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняемыеПараметрыЗначениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЗаполняемыеПараметры.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекДанные.ИзПриема = Не ЗначениеЗаполнено(ТекДанные.Значение) И ЗначениеЗаполнено(ТекДанные.ЗначениеПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняемыеПараметрыЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ЗаполняемыеПараметры.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	ТекДанные.ИзПриема = Не ЗначениеЗаполнено(ТекДанные.Значение) И ЗначениеЗаполнено(ТекДанные.ЗначениеПоУмолчанию);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняемыеПараметрыЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ЗаполняемыеПараметры.ТекущиеДанные;
	Если ТекДанные = Неопределено Или Не ЗначениеЗаполнено(ТекДанные.ИмяПараметра)
		Или Не ТекДанные.ТипЗначения.СодержитТип(Тип("Строка"))
	Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрШаблонаОсмотра = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекДанные.ИмяПараметра, "ПараметрШаблонаОсмотра"); 
	
	ДополнительныеПараметры = Новый Структура("Параметр", ТекДанные.ИмяПараметра);
	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыборЗначенияПараметраЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	МедицинскаяДеятельностьКлиент.ПоказатьФормуВводаТекста(ТекДанные.Значение, ПараметрШаблонаОсмотра, ОповещениеОВыборе);  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ScanData" Тогда
		
		Если ВводДоступен() Тогда
			
			ТипШК = Неопределено;
			РаботаСТорговымОборудованиемКлиент.ОбработатьСобытиеСШКФормы(ЭтаФорма, Параметр, ТипШК);
			
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзменилисьПодписи"
		И Параметр = Объект.Ссылка
	Тогда
		ЭтотОбъект.Прочитать();
		ОбновитьДанныеПослеПодписания();
		ОбновитьПредпросмотрНаСервере();
	ИначеЕсли ИмяСобытия = "ОбновитьСписокПодписей"
		И Параметр = Объект.Ссылка
	Тогда
		ОбновитьСписокПодписей();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьШтрихкодМедкарты(МедкартаСсылка = Неопределено)
	
	Если МедкартаСсылка = Неопределено Тогда
		МедкартаСсылка = Объект.Ссылка;
	КонецЕсли;
	
	НЗ = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
	НЗ.Отбор.Владелец.Установить(МедкартаСсылка);
	НЗ.Прочитать();
	Если НЗ.Количество() <> 0 Тогда
		ШтрихКод	 = НЗ[0].Штрихкод;
		ТипШтрихкода = НЗ[0].ТипШтрихкода;
	КонецЕсли;
	
	Возврат НЗ.Количество() <> 0;
	
КонецФункции

&НаКлиенте
Функция СШКМедКарта(МедКарта, ВладелецКарты, СШК) Экспорт
	
	Если МедКарта <> Объект.Ссылка Тогда
		
		ОткрытьЗначение(МедКарта);
		
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаСервере
Процедура ФормированиеНомера(ГенерироватьНомерКарты = Истина)
	ОтраслевыеДополнения.ФормированиеНомера(Объект, ГенерироватьНомерКарты);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПараметров()
	
	ДанныеПараметров = МедицинскаяДеятельность.ПолучитьВычисляемыеЗначенияПараметровМедкарты(Объект.Ссылка, Объект.ВидКарты, Объект.ЗаполняемыеПараметры);
	
	// Получаем все заполненные вручную пользователем параметры
	ВручнуюЗаполненныеПараметры = Новый Массив;
	Для Каждого СтрокаПараметра Из Объект.ЗаполняемыеПараметры Цикл
		Если ЗначениеЗаполнено(СтрокаПараметра.ИмяВручнуюЗаполненногоПараметра) Тогда
			ВручнуюЗаполненныеПараметры.Добавить(Новый Структура("Параметр, Значение", СтрокаПараметра.ИмяВручнуюЗаполненногоПараметра, СтрокаПараметра.Значение));
		КонецЕсли;
	КонецЦикла;
	
	Объект.ЗаполняемыеПараметры.Очистить();
	Для Каждого кзПараметр Из ДанныеПараметров.Параметры Цикл
		СтруктураПараметра = кзПараметр.Значение;
		НоваяСтрока = Объект.ЗаполняемыеПараметры.Добавить();
		НоваяСтрока.ИмяПараметра = СтруктураПараметра.Параметр;
		НоваяСтрока.ТипЗначения = СтруктураПараметра.ТипЗначения;
		НоваяСтрока.ЗначениеПоУмолчанию = СтруктураПараметра.ВычисленноеЗначение;
		
		Если СтруктураПараметра.ЭтоНовый Тогда
			НоваяСтрока.Значение = СтруктураПараметра.ЗначениеПоУмолчанию;
		Иначе
			НоваяСтрока.Значение = СтруктураПараметра.РучноеЗначение;
			НоваяСтрока.ИзПриема = Не ЗначениеЗаполнено(НоваяСтрока.Значение) И ЗначениеЗаполнено(СтруктураПараметра.ВычисленноеЗначение);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаПараметра Из ВручнуюЗаполненныеПараметры Цикл
		НоваяСтрока = Объект.ЗаполняемыеПараметры.Добавить();
		НоваяСтрока.ИмяВручнуюЗаполненногоПараметра = СтрокаПараметра.Параметр;
		НоваяСтрока.Значение = СтрокаПараметра.Значение;
	КонецЦикла;
	
	ДобавитьУсловноеОформлениеПараметровМедкарты();
	ОбновитьОтображениеДанных(Элементы.ЗаполняемыеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначенияПараметраЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	Если Значение = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокиПараметра = Объект.ЗаполняемыеПараметры.НайтиСтроки(Новый Структура("ИмяПараметра", ДополнительныеПараметры.Параметр));
	Если СтрокиПараметра.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	СтрокаПараметра = СтрокиПараметра[0];
	СтрокаПараметра.Значение = Значение;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредпросмотрНаСервере()
	
	Предпросмотр.Очистить();
	Предпросмотр.ОтображатьСетку = Ложь;
	Предпросмотр.ОтображатьЗаголовки = Ложь;
	Предпросмотр.ОтображатьГруппировки = Ложь;
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ОписаниеОшибки = "";
		Если Объект.ПодписанЭП Тогда
			ТабДок = ПолучитьСформированныйТабДок(Объект.Ссылка);
		КонецЕсли;
		
		Если ТабДок = Неопределено Тогда
			ТабДок = МедицинскаяДеятельность.ПолучитьТекстТитульного(Объект.Ссылка, Объект.Клиент, ОписаниеОшибки,,, РедактированиеРазрешено);
		КонецЕсли;
		
		Если ТабДок <> Неопределено Тогда
			Предпросмотр.Вывести(ТабДок);
			КопируемыеСвойстваТабДока = УправлениеПечатью.КопируемыеСвойстваТабличногоДокумента() + ",КлючПараметровПечати";
			ЗаполнитьЗначенияСвойств(Предпросмотр, ТабДок, КопируемыеСвойстваТабДока);
		ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСформированныйТабДок(Медкарта)
	
	ДанныеФайловЭМД = доп_РаботаСФайлами.ПолучитьДанныеФайловЭМД(Медкарта, , ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	Если ДанныеФайловЭМД.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(ДанныеФайловЭМД.Получить(ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор()).ДвоичныеДанные.ОткрытьПотокДляЧтения());
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	УстановитьШтампыЭЦП(ТабДок, Медкарта);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьШтампыЭЦП(ТабДок, Медкарта)
	
	ОбластьЭЦП = Справочники.ВидыМедицинскихКарт.ПолучитьОбластьЭЦПМакетаМедкарты(Медкарта.ВидКарты);
	
	Если ОбластьЭЦП = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасшифровокПоРолям = Справочники.ВидыМедицинскихКарт.ПараметрыРасшифровокЭЦП(Медкарта.ВидКарты);
	
	Если ПараметрыРасшифровокПоРолям = Неопределено
		Или ПараметрыРасшифровокПоРолям.Количество() = 0
	Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РолиИПодписиЭМД.РольПодписи КАК РольПодписи,
		|	ЭлектронныеПодписи.Сертификат КАК Сертификат,
		|	ЭлектронныеПодписи.ДатаПодписи КАК ДатаПодписи
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РолиИПодписиЭМД КАК РолиИПодписиЭМД
		|		ПО (РолиИПодписиЭМД.Документ = &Документ)
		|			И (РолиИПодписиЭМД.УИД_ЭЦП = ЭлектронныеПодписи.УникальныйИдентификатор)
		|			И (РолиИПодписиЭМД.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ИЛИ РолиИПодписиЭМД.Пользователь = ЭлектронныеПодписи.УстановившийПодпись)";
	
	Запрос.УстановитьПараметр("Документ", Медкарта);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеПараметровРасшифровок = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		
		ПараметрРасшифровки = ПараметрыРасшифровокПоРолям.Получить(Выборка.РольПодписи);
		Если ПараметрРасшифровки <> Неопределено Тогда
			ДанныеПараметровРасшифровок.Вставить(ПараметрРасшифровки, ЭЦП_УМЦ_Сервер.ПолучитьДанныеСертификата(Выборка.Сертификат, Медкарта, Выборка.ДатаПодписи));
		КонецЕсли;
	КонецЦикла;
	
	Области = Новый Массив;
	Для Строка = 1 По ТабДок.ВысотаТаблицы Цикл
		Для Колонка = 1 По ТабДок.ШиринаТаблицы Цикл
			ТекОбласть = ТабДок.Область(Строка, Колонка);
			
			Если Области.Найти(ТекОбласть.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Области.Добавить(ТекОбласть.Имя);
			
			Если ЗначениеЗаполнено(ТекОбласть.Расшифровка)
				И ТипЗнч(ТекОбласть.Расшифровка) = Тип("Структура")
				И ТекОбласть.Расшифровка.Свойство("ПараметрРасшифровки")
			Тогда
				
				ДанныеПодписи = ДанныеПараметровРасшифровок.Получить(ТекОбласть.Расшифровка.ПараметрРасшифровки);
				Если ДанныеПодписи <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(ОбластьЭЦП.Параметры, ДанныеПодписи);
					ТабДокЭЦП = Новый ТабличныйДокумент;
					ТабДокЭЦП.Вывести(ОбластьЭЦП);
					ТабДок.ВставитьОбласть(ТабДокЭЦП.Области[0], ТекОбласть);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеПараметровМедкарты()
	
	УсловноеОформление.Элементы.Очистить();
	Для Каждого СтрокаПараметрМедкарты Из Объект.ЗаполняемыеПараметры Цикл
		ДобавитьУсловноеОформлениеПараметраМедкарты(СтрокаПараметрМедкарты.ИмяПараметра, СтрокаПараметрМедкарты.ЗначениеПоУмолчанию);
	КонецЦикла;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	Поле = ЭлементУО.Поля.Элементы.Добавить();
	Поле.Использование = Истина;
	Поле.Поле = Новый ПолеКомпоновкиДанных("ЗаполняемыеПараметры");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполняемыеПараметры.ИмяВручнуюЗаполненногоПараметра");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеПараметраМедкарты(Параметр, ЗначениеПоУмолчанию)
	
	// Текст для не заполненных вручную значений парамтеров
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	Поле = ЭлементУО.Поля.Элементы.Добавить();
	Поле.Использование = Истина;
	Поле.Поле = Новый ПолеКомпоновкиДанных("ЗаполняемыеПараметрыЗначение");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполняемыеПараметры.ИмяПараметра");
	ЭлементОтбора.ПравоеЗначение = Параметр;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполняемыеПараметры.Значение");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементОформления = ЭлементУО.Оформление.Элементы.Найти("Текст");
	ЭлементОформления.Значение = Строка(ЗначениеПоУмолчанию);
	ЭлементОформления.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПоВидуМедкарты()
	
	Роли = Справочники.ВидыМедицинскихКарт.РолиДляПодписания(Объект.ВидКарты);
	ПодписаниеДоступно = Роли.Количество() > 0;
	РедактированиеРазрешено = Справочники.ВидыМедицинскихКарт.ДоступноРучноеРедактирование(Объект.ВидКарты);
	
	Элементы.УдалитьВручнуюДобавленныйПараметр.Видимость = РедактированиеРазрешено;
	Элементы.ГруппаЭП.Видимость = ИспользуютсяЭП И ПодписаниеДоступно;
	
	ЗаполнитьЗначенияПустыхПараметровПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредпросмотрВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Элементы.Предпросмотр.Редактирование = Ложь;
	Если ЗначениеЗаполнено(Область.Расшифровка) Тогда
		
		Если ТипЗнч(Область.Расшифровка) <> Тип("Структура")
			Или Область.Расшифровка.Свойство("ПараметрРасшифровки")
			Или Не Область.Расшифровка.Свойство("СтрокаПараметров")
		Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		СтрокаПараметров = Область.Расшифровка.СтрокаПараметров;
		МассивПараметровВШаблоне = ОбщегоНазначенияБИТКлиентСервер.НайтиПараметрыВТексте(СтрокаПараметров, "[", "]");
		
		СписокВыбора = Область.Расшифровка.СпискиВыбора.Получить(СтрокаПараметров);
		ИмяПараметра = "";
		
		// Работа с параметрами, у которых нет отдельной формы заполнения 
		// если параметр имеет "возможность редактирования" пользователем, то он работает как шаблон.
		Если Не ЗначениеЗаполнено(Область.Расшифровка.ИмяФормыЗаполнения) Тогда
			
			Если МассивПараметровВШаблоне.Количество() = 0 Тогда
				
				ИмяПараметра = СтрокаПараметров;
				
				Если СписокВыбора = Неопределено Тогда
					Элементы.Предпросмотр.Редактирование = Истина;
					ТекстЯчейкиПередНепосредственнымРедактированием = Область.Текст;
					Возврат;
				ИначеЕсли СписокВыбора.Получить("ВозможностьРедактирования") <> Истина Тогда
					СтандартнаяОбработка = Ложь;
					ЗначенияВыбора = СписокВыбора.Получить("Значения");
					
					Если ТипЗнч(ЗначенияВыбора) = Тип("Массив")	Тогда
						// Если у параметра 2 значения выбора и один уже выбран, то автоматически переключаем на второй (ветка с запретом ручного ввода текста)
						Если Не ПереключитьЗначениеЯчейкиПоНажатиюЕслиВозможно(Область, ЗначенияВыбора, Область.Текст, ИмяПараметра) Тогда
							ОткрытьВыборТекстаВОбластьИзСпискаВыбора(Область, ЗначенияВыбора, ИмяПараметра); // Выбор из выпадающего списка.
						КонецЕсли;
					КонецЕсли;
					
					Возврат;
				КонецЕсли;
				
			ИначеЕсли МассивПараметровВШаблоне.Количество() = 1
				И ЭтоЯчейкаМедкартыСЕдинственнымПараметромЖесткогоВыбора(Область.Расшифровка, СписокВыбора, ИмяПараметра) // Изменяет переменную.СписокВыбора.
			Тогда
				СтандартнаяОбработка = Ложь;
				ЗначенияВыбора = СписокВыбора["Значения"];
				
				ТекущееЗначение = ЗначениеВручнуюЗаполняемогоПараметра(ИмяПараметра);
				Если Не ЗначениеЗаполнено(ТекущееЗначение) Тогда
					ТекущееЗначение = ЗначениеВручнуюЗаполняемогоПараметраЕдинственногоИзТекста(СтрокаПараметров, ИмяПараметра, Область.Текст);
				КонецЕсли;
				
				Если Не ПереключитьЗначениеЯчейкиПоНажатиюЕслиВозможно(Область, ЗначенияВыбора, ТекущееЗначение, ИмяПараметра, СтрокаПараметров) Тогда
					ОткрытьВыборТекстаВОбластьИзСпискаВыбора(Область, ЗначенияВыбора, ИмяПараметра, СтрокаПараметров); // Выбор из выпадающего списка.
				КонецЕсли;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		ЗначенияПараметровСтроки = Новый Массив;
		ЗначенияПустыхПараметровСтрокиПоУмолчанию = Новый Массив;
		
		Если МассивПараметровВШаблоне.Количество() = 0 Тогда // И есть форма редактирования или возможность ручного редактирования.
			СтруктураПараметра = Новый Структура("Параметр, Значение", СтрокаПараметров, "");
			СтрокиПараметра = Объект.ЗаполняемыеПараметры.НайтиСтроки(Новый Структура("ИмяВручнуюЗаполненногоПараметра", СтрокаПараметров));
			Если СтрокиПараметра.Количество() > 0 Тогда
				СтруктураПараметра.Значение = СтрокиПараметра[0].Значение;
			КонецЕсли;
			ЗначенияПараметровСтроки.Добавить(СтруктураПараметра);
		Иначе
			// Если в шаблоне один параметр с вариантами - он работает как параметр (без доп. формы)
			Если МассивПараметровВШаблоне.Количество() = 1 И 
				Область.Расшифровка.СпискиВыбора.Получить(МассивПараметровВШаблоне[0].ИмяПараметра) <> Неопределено И
				Область.Расшифровка.СпискиВыбора.Получить(МассивПараметровВШаблоне[0].ИмяПараметра).Получить("ВозможностьРедактирования") = Ложь
			Тогда
				
				ИмяПараметра = МассивПараметровВШаблоне[0].ИмяПараметра;
				МассивСпискаВыбора = Область.Расшифровка.СпискиВыбора.Получить(ИмяПараметра).Получить("Значения");	
				ОбластьРасшифровкаСтрокиПараметров = Область.Расшифровка.СтрокаПараметров;
				
				// Дополнительные параметры и значения для выбора, используется и при вызове списка и при установке
				ДополнительныеПараметры = Новый Структура("ОбластьТабДока", Область.Имя);
				ДополнительныеПараметры.Вставить("Параметр", ИмяПараметра); 
				ДополнительныеПараметры.Вставить("ТекстШаблона",ОбластьРасшифровкаСтрокиПараметров);
				СписокЗначенийПараметра = Новый СписокЗначений;
				СписокЗначенийПараметра.ЗагрузитьЗначения(МассивСпискаВыбора);
	
				//Если варианта всего два - автоматически переключаем, ЕСЛИ текущий текст ИМЕЕТ хоть какие-то значения
				//Из выбранных. Может быть ситуация, когда есть два значения, но ни одно не выбрано, тут пользователь сам выбирает
				Если МассивСпискаВыбора.Количество() = 2 Тогда
					// Мы заменили, больше ничего не надо делать 
					Если СтрЗаменить(ОбластьРасшифровкаСтрокиПараметров,СтрШаблон("[%1]",ИмяПараметра),массивСпискаВыбора[0]) = Область.Текст
						Тогда
					                  
						 УстановитьТекстВОбластьПослеВыбораИзМеню(СписокЗначенийПараметра.Получить(1),ДополнительныеПараметры);
					    Возврат;
					ИначеЕсли СтрЗаменить(ОбластьРасшифровкаСтрокиПараметров,СтрШаблон("[%1]",ИмяПараметра),массивСпискаВыбора[1]) = Область.Текст
					    Тогда
						
						УстановитьТекстВОбластьПослеВыбораИзМеню(СписокЗначенийПараметра.Получить(0),ДополнительныеПараметры);
					 	Возврат;
					КонецЕсли;	
				КонецЕсли;
				
				// В других случаях - отправляем на меню выпадающим списком
				ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("УстановитьТекстВОбластьПослеВыбораИзМеню", ЭтотОбъект, ДополнительныеПараметры);
				ПоказатьВыборИзМеню(ОписаниеОповещенияОЗавершении, СписокЗначенийПараметра, Область);
				
				// Предотвращаем дальнейшие вычисления с шаблонами
				Возврат;
			КонецЕсли;
			
			// В остальных случаях мы проходим по всем шаблонам, получаем по каждому форму заполнения и 
			Для Каждого ПараметрРасшифровки Из МассивПараметровВШаблоне Цикл
				СтруктураПараметра = Новый Структура("Параметр, Значение", ПараметрРасшифровки.ИмяПараметра, "");
				СтрокиПараметра = Объект.ЗаполняемыеПараметры.НайтиСтроки(Новый Структура("ИмяВручнуюЗаполненногоПараметра", ПараметрРасшифровки.ИмяПараметра));
				Если СтрокиПараметра.Количество() > 0 Тогда
					СтруктураПараметра.Значение = СтрокиПараметра[0].Значение;
				КонецЕсли;
				ЗначенияПараметровСтроки.Добавить(СтруктураПараметра);
				
				СтрокиЗначений = ЗначенияПустыхПараметровПоУмолчанию.НайтиСтроки(Новый Структура("ИмяПараметра", ПараметрРасшифровки.ИмяПараметра));
				Если СтрокиЗначений.Количество() > 0 Тогда
					ЗначенияПустыхПараметровСтрокиПоУмолчанию.Добавить(Новый Структура("ИмяПараметра, Значение", СтрокиЗначений[0].ИмяПараметра, СтрокиЗначений[0].Значение));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Расшифровка", Область.Расшифровка);
		ПараметрыОткрытия.Вставить("ЗначенияПараметровСтроки", ЗначенияПараметровСтроки);
		ПараметрыОткрытия.Вставить("ЗначенияПустыхПараметровСтрокиПоУмолчанию", ЗначенияПустыхПараметровСтрокиПоУмолчанию);
		
		ДополнительныеПараметры = Новый Структура("ОбластьТабДока", Область.Имя);
		
		Если ЗначениеЗаполнено(Область.Расшифровка.ИмяФормыЗаполнения) Тогда
			ИмяФормыЗаполнения = Область.Расшифровка.ИмяФормыЗаполнения;
			// В этом случае в строке только один параметр
			ДополнительныеПараметры.Вставить("Параметр", ЗначенияПараметровСтроки[0].Параметр);
			ДополнительныеПараметры.Вставить("СтрокаПараметров", Область.Расшифровка.СтрокаПараметров);
			ПараметрыОткрытия.Вставить("НачальноеЗначение", ЗначенияПараметровСтроки[0].Значение); // Обработка.ИнтерфейсВводаПолейЭМД.ЗанятостьПациента
		Иначе
			ИмяФормыЗаполнения = "Справочник.МедицинскиеКарты.Форма.ЗаполнениеПараметровШаблона";
		КонецЕсли;
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗаполненияПараметров", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму(ИмяФормыЗаполнения, ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоЯчейкаМедкартыСЕдинственнымПараметромЖесткогоВыбора(ОбластьРасшифровка, СписокВыбора = Неопределено, ИмяПараметра = "")
	
	Если ОбластьРасшифровка.СпискиВыбора.Количество() = 1
		// И ОбластьРасшифровка.Синонимы.Количество() = 0
	Тогда
		Для Каждого КлючЗначение Из ОбластьРасшифровка.СпискиВыбора Цикл
			СписокВыбора = КлючЗначение.Значение;
			ИмяПараметра = КлючЗначение.Ключ;
			Если СписокВыбора.Получить("ВозможностьРедактирования") = Ложь Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ПереключитьЗначениеЯчейкиПоНажатиюЕслиВозможно(Область, ЗначенияВыбора, ТекущееЗначение, ИмяПараметра, ТекстШаблона = Неопределено)
	
	// Если у параметра 2 значения выбора и один уже выбран, то автоматически переключаем на второй (ветка с запретом ручного ввода текста)
	Если ЗначенияВыбора.Количество() = 2 Тогда
		
		Если ЗначенияВыбора[0] = ТекущееЗначение Тогда
			НовоеЗначение = ЗначенияВыбора[1];
		ИначеЕсли ЗначенияВыбора[1] = ТекущееЗначение Тогда
			НовоеЗначение = ЗначенияВыбора[0];
		КонецЕсли;
		
		Если НовоеЗначение <> Неопределено Тогда
			// Переключение на новое значение, выход
		    ДополнительныеПараметры = Новый Структура("ОбластьТабДока", Область.Имя);
			ДополнительныеПараметры.Вставить("Параметр", ИмяПараметра);
			Если ТекстШаблона <> Неопределено Тогда
				ДополнительныеПараметры.Вставить("ТекстШаблона", ТекстШаблона);
			КонецЕсли;
			УстановитьТекстВОбластьПослеВыбораИзМеню(НовоеЗначение, ДополнительныеПараметры);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьВыборТекстаВОбластьИзСпискаВыбора(Область, ЗначенияВыбора, ИмяПараметра, ТекстШаблона = "")
	
	ДополнительныеПараметры = Новый Структура("ОбластьТабДока", Область.Имя);
	ДополнительныеПараметры.Вставить("Параметр", ИмяПараметра);
	
	Если ЗначениеЗаполнено(ТекстШаблона) Тогда
		ДополнительныеПараметры.Вставить("ТекстШаблона", ТекстШаблона);
	КонецЕсли;	
	
	СписокЗначенийПараметра = Новый СписокЗначений;
	СписокЗначенийПараметра.ЗагрузитьЗначения(ЗначенияВыбора);
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("УстановитьТекстВОбластьПослеВыбораИзМеню", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВыборИзМеню(ОписаниеОповещенияОЗавершении, СписокЗначенийПараметра, Область);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстВОбластьПослеВыбораИзМеню(ВыбранныйЭлемент, ДопПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранныйЭлемент) = Тип("ЭлементСпискаЗначений") Тогда
		ВыбранноеЗначение = ВыбранныйЭлемент.Значение;
	Иначе
		ВыбранноеЗначение = ВыбранныйЭлемент;
	КонецЕсли;
	
	СтрокиПараметра = Объект.ЗаполняемыеПараметры.НайтиСтроки(Новый Структура("ИмяВручнуюЗаполненногоПараметра", ДопПараметры.Параметр));
	Если СтрокиПараметра.Количество() = 0 Тогда
		СтрокаПараметра = Объект.ЗаполняемыеПараметры.Добавить();
		СтрокаПараметра.ИмяВручнуюЗаполненногоПараметра = ДопПараметры.Параметр;
	Иначе
		СтрокаПараметра = СтрокиПараметра[0];
	КонецЕсли;
	
	// Для параметров нужно просто само значение
	СтрокаПараметра.Значение = ВыбранноеЗначение;
	
	//Если СтрНайти(ДопПараметры.Параметр, "[") = 0 Тогда
	Если ДопПараметры.Свойство("ТекстШаблона") Тогда
		ЗначениеЯчейки = СтрЗаменить(ДопПараметры.ТекстШаблона, "["+ДопПараметры.Параметр+"]", ВыбранноеЗначение);
	Иначе
		ЗначениеЯчейки = ВыбранноеЗначение;
	КонецЕсли;
		
	Предпросмотр.Область(ДопПараметры.ОбластьТабДока).Текст = ЗначениеЯчейки;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция ЗначениеВручнуюЗаполняемогоПараметраЕдинственногоИзТекста(СтрокаПараметров, ИмяПараметра, ТекстЯчейки)
	
	// Вычленение значения параметра из текста ячейки
	НачПозШ = СтрНайти(СтрокаПараметров, ИмяПараметра);
	Если НачПозШ <= 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонПозШ = СтрНайти(СтрокаПараметров, "]",, НачПозШ) + 1;
	
	ТекстДоПараметра	 = Лев(СтрокаПараметров, НачПозШ - 2);
	ТекстПослеПараметра	 = Сред(СтрокаПараметров, КонПозШ);
	
	Значение = Сред(ТекстЯчейки, СтрДлина(ТекстДоПараметра)+1, СтрДлина(ТекстЯчейки) - СтрДлина(ТекстПослеПараметра) - СтрДлина(ТекстДоПараметра));
	
	Возврат Значение;
	
КонецФункции

&НаКлиенте
Функция ЗначениеВручнуюЗаполняемогоПараметра(ИмяПараметра, ЗначениеПоУмолчанию = Неопределено)
	
	СтрокиПараметра = Объект.ЗаполняемыеПараметры.НайтиСтроки(Новый Структура("ИмяВручнуюЗаполненногоПараметра", ИмяПараметра));
	Если СтрокиПараметра.Количество() > 0 Тогда
		Возврат СтрокиПараметра[0].Значение;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию; // Нет данных в табличной части.
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗначениеВручнуюЗаполняемогоПараметра(ИмяПараметра, Значение)
	
	СтрокиПараметра = Объект.ЗаполняемыеПараметры.НайтиСтроки(Новый Структура("ИмяВручнуюЗаполненногоПараметра", ИмяПараметра));
	Если СтрокиПараметра.Количество() > 0 Тогда
		СтрокаПараметра = СтрокиПараметра[0];
	Иначе
		СтрокаПараметра = Объект.ЗаполняемыеПараметры.Добавить();
		СтрокаПараметра.ИмяВручнуюЗаполненногоПараметра = ИмяПараметра;
	КонецЕсли;
	
	СтрокаПараметра.Значение = Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияПараметров(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Параметр") Тогда
		ЗначениеИзмененногоПараметра = Результат;
		СтрокиЗначенияПустогоПараметра = ЗначенияПустыхПараметровПоУмолчанию.НайтиСтроки(Новый Структура("ИмяПараметра", ДопПараметры.Параметр));
		Если Не ЗначениеЗаполнено(ЗначениеИзмененногоПараметра)
			И СтрокиЗначенияПустогоПараметра.Количество() > 0
		Тогда
			ЗначениеИзмененногоПараметра = СтрокиЗначенияПустогоПараметра[0].Значение;
		КонецЕсли;
		ИзмененныеПараметры = Новый Массив;
		ИзмененныеПараметры.Добавить(Новый Структура("Параметр, Значение", ДопПараметры.Параметр, ЗначениеИзмененногоПараметра));
		Если СтрНайти(ДопПараметры.СтрокаПараметров, "[") = 0 Тогда
			НовыйТекстОбласти = ЗначениеИзмененногоПараметра;
		Иначе
			НовыйТекстОбласти = СтрЗаменить(ДопПараметры.СтрокаПараметров, СтрШаблон("[%1]", ДопПараметры.Параметр), ЗначениеИзмененногоПараметра);
		КонецЕсли;
	Иначе
		ИзмененныеПараметры = Результат.ИзмененныеПараметры;
		НовыйТекстОбласти = Результат.ТекстСтроки;
	КонецЕсли;
	
	Для Каждого ЗначениеПараметра Из ИзмененныеПараметры Цикл
		СтрокиПараметра = Объект.ЗаполняемыеПараметры.НайтиСтроки(Новый Структура("ИмяВручнуюЗаполненногоПараметра", ЗначениеПараметра.Параметр));
		Если СтрокиПараметра.Количество() = 0 Тогда
			СтрокаПараметра = Объект.ЗаполняемыеПараметры.Добавить();
			СтрокаПараметра.ИмяВручнуюЗаполненногоПараметра = ЗначениеПараметра.Параметр;
		Иначе
			СтрокаПараметра = СтрокиПараметра[0];
		КонецЕсли;
		СтрокаПараметра.Значение = ЗначениеПараметра.Значение;
	КонецЦикла;
	
	Модифицированность = ИзмененныеПараметры.Количество() > 0;
	Предпросмотр.Область(ДопПараметры.ОбластьТабДока).Текст = НовыйТекстОбласти;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредпросмотрПриАктивизации(Элемент)
	
	Элементы.Предпросмотр.Редактирование = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредпросмотрПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	
	// Оценка факта редактирования.
	Если ТекстЯчейкиПередНепосредственнымРедактированием = Область.Текст Тогда
		Возврат; // Не было реального изменения текста.
	КонецЕсли;
	
	ИмяВручнуюЗаполненногоПараметра = Область.Расшифровка.СтрокаПараметров;
	СтрокиПараметра = Объект.ЗаполняемыеПараметры.НайтиСтроки(Новый Структура("ИмяВручнуюЗаполненногоПараметра", ИмяВручнуюЗаполненногоПараметра));
	Если СтрокиПараметра.Количество() = 0 Тогда
		Если Не ЗначениеЗаполнено(Область.Текст) Тогда
			Возврат;
		КонецЕсли;
		СтрокаПараметра = Объект.ЗаполняемыеПараметры.Добавить();
		СтрокаПараметра.ИмяВручнуюЗаполненногоПараметра = ИмяВручнуюЗаполненногоПараметра;
	Иначе
		СтрокаПараметра = СтрокиПараметра[0];
	КонецЕсли;
	
	СтрокаПараметра.Значение = Область.Текст;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПустыхПараметровПоУмолчанию()
	
	ЗначенияПустыхПараметровПоУмолчанию.Очистить();
	ЗначенияПараметров = Справочники.ВидыМедицинскихКарт.ПолучитьЗначенияПустыхПараметровПоУмолчанию(Объект.ВидКарты);
	Для Каждого ЗначениеПараметра Из ЗначенияПараметров Цикл
		ЗаполнитьЗначенияСвойств(ЗначенияПустыхПараметровПоУмолчанию.Добавить(), ЗначениеПараметра);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписи

#Область ЭлектронныеПодписиКоманды

&НаКлиенте
Процедура ПодписатьВсе(Команда)
	
	ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, Ложь, Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПодписаниюЭМД(Команда)
	
	ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, Истина, Ложь, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписиСлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокПодписей()
	
	доп_СертификатыЭЦП.ЗаполнитьСписокПодписей(Объект.Ссылка, УникальныйИдентификатор, Элементы.ГруппаЭП, ЭлектронныеПодписи, , СводкаHTML);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПослеПодписания()
	
	ОбновитьСписокПодписей();
	УстановитьДоступностьВидимостьПоЭП();
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписиУправлениеДоступностьюПолей

&НаСервере
Процедура УстановитьДоступностьВидимостьПоЭП()
	
	Элементы.ГруппаЭП.Видимость = ИспользуютсяЭП;
	
	//ЭтоСупервайзер = ЭЦП_УМЦ_Сервер.ЭтоСупервайзер();
	ОтсутствуютПраваНаИзменение = Не ПравоДоступа("Изменение", Объект.Ссылка.Метаданные());
	
	//ИзмененияЗапрещены = ОтсутствуютПраваНаИзменение Или (ИспользуютсяЭП И Не ЭтоСупервайзер И Объект.ПодписанЭП);
	ИзмененияЗапрещены = ОтсутствуютПраваНаИзменение Или (ИспользуютсяЭП И Объект.ПодписанЭП);
	
	Элементы.ОбновитьПредпросмотр.Доступность	= Не ИзмененияЗапрещены;
	Элементы.ПрисвоитьШтрихкод.Доступность		= Не ИзмененияЗапрещены;
	Элементы.ГруппаДанные.ТолькоПросмотр		= ИзмененияЗапрещены;
	
	УстановитьДоступностьПодчиненныхКнопок(Элементы.ГруппаНаименование, ИзмененияЗапрещены);
	УстановитьДоступностьПодчиненныхКнопок(Элементы.ЗаполняемыеПараметры.КоманднаяПанель, ИзмененияЗапрещены);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПодчиненныхКнопок(Родитель, ИзмененияЗапрещены, ИсключаемыеЭлементы = Неопределено)
	
	Для Каждого ПодчиненныйЭлемент Из Родитель.ПодчиненныеЭлементы Цикл
		Если ИсключаемыеЭлементы <> Неопределено
			И ИсключаемыеЭлементы.Найти(ПодчиненныйЭлемент) <> Неопределено
		Тогда
			Продолжить;
		КонецЕсли;
		ПодчиненныйЭлемент.Доступность = Не ИзмененияЗапрещены;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
